src/Enums/ВариантыОтраженияКорректировокРеализаций/ВариантыОтраженияКорректировокРеализаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОтраженияКорректировокРеализаций</name>
  <enumValues>
    <name>ОтразитьНаПрочихДоходах</name>
  </enumValues>
  <enumValues>
    <name>СписатьНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьВыручку</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьРеализациюУменьшитьСкладскиеОстатки</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьРеализациюУчестьПриИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьВыручку</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьРеализациюУвеличитьСкладскиеОстатки</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьРеализациюУчестьПриИнвентаризации</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВариантыОтраженияКорректировокРеализаций/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ТекстПояснения = "";
	
	Если Параметры.Отбор.Свойство("Ссылка")
	 И ТипЗнч(Параметры.Отбор.Ссылка) = Тип("СписокЗначений") Тогда
	 	
	 	ДоступныеВарианты = Параметры.Отбор.Ссылка;
		Если ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУчестьПриИнвентаризации) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу больше. Используется ордерная схема при отражении излишков и недостач.
            |
            |'
            |;uk='Кількість товару за документом більше. Використовується ордерна схема при відображенні надлишків і нестач.
            |
            |'");
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУменьшитьСкладскиеОстатки) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу больше. Не используется ордерная схема при отражении излишков и недостач.
            |
            |'
            |;uk='Кількість товару за документом більше. Не використовується ордерна схема при відображенні надлишків і нестач.
            |
            |'");
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУчестьПриИнвентаризации) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу меньше. Используется ордерная схема при отражении излишков и недостач.
            |
            |'
            |;uk='Кількість товару по документу менше. Використовується ордерна схема при відображенні надлишків і нестач.
            |
            |'");
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУвеличитьСкладскиеОстатки) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу меньше. Не используется ордерная схема при отражении излишков и недостач.
            |
            |'
            |;uk='Кількість товару по документу менше. Не використовується ордерна схема при відображенні надлишків і нестач.
            |
            |'");
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстПояснения = ТекстПояснения + НСтр("ru='Выберите вариант отражения расхождений:';uk='Виберіть варіант відображення розбіжностей:'");
	
КонецПроцедуры

#КонецОбласти
